// Задача 1. Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.
/*
int[] ChangeElements (int size, int minValue, int maxValue)
{

}













//Задача 2. Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.
// Задача 3. Задайте одномерный массив из 12 случайных чисел. Найдите количество элементов массива, значения которых лежат в отрезке [10,99]
// Задача 4. Найдите произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д. Результат запишите в новом массиве.

int[] Array12(int size, int minValue, int maxValue)
int[] ArrayRandom12 = new int [size];
minValue = 0;
maxValue = 12;
{
    for (int i = 0; i < size; i++)
    ArrayRandom[i] = new Random().Next(minValue, maxValue + 1);
}

*/