//Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.

/*
int Findcomposition(int num)
int composition = 1;
{
  for (int current =1; current < curernt; current++)
  {
    composition = current * current;
    current++;
  }
  composition = current * current;

}
Console.Write("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Writeline($"Произведение чисел от 1 до {a} ")
*/